Tekla Open API Reference for Tekla Structures 2025
Plugin Methods
The Plugin type exposes the following members.
Methods
Name | Description
ApplyStandardValues
 Applies the values of the specified file as the default values for the dialog belonging to this plug-in. This will affect each Insert call of the plug-ins with the same name.
Delete
 Deletes the plug-in from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetDoubleAttribute
 Gets the value of the specified double attribute of the plug-in.
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDrawing
 Gets the drawing where the drawing object is.
 (Inherited from DrawingObject.)
GetIntAttribute
 Gets the value of the specified int attribute of the plug-in.
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetRelatedObjects()
 Gets the related objects of the current object.
 (Inherited from DrawingObject.)
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
 (Inherited from DrawingObject.)
GetStringAttribute
 Gets the value of the specified string attribute of the plug-in.
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetView
 Gets the view where the drawing object is.
 (Inherited from DrawingObject.)
Insert
 Inserts the plug-in into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from DatabaseObject.)
LoadStandardValues
 Sets the values from the specified file to this plug-in.
Modify
 Modifies the plug-in in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the plug-in from the current drawing database.
 (Overrides DatabaseObject.Select().)
SetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetPickerInput
 Defines the sequence of inputs to use in place of interactive picks when the plug-in is inserted to a drawing.
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
ToString
 Changes the string presentation of the drawing object.
 (Inherited from DrawingObject.)
TryGetAttribute(String, Double)
 Gets the value of the specified double attribute of the plug-in.
TryGetAttribute(String, Int32)
 Gets the value of the specified int attribute of the plug-in.
TryGetAttribute(String, String)
 Gets the value of the specified string attribute of the plug-in.
TrySetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
Top
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace